# Задача 2: Найдите сумму цифр трехзначного числа. 
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input("Введите число: "))
a1 = int(a/100)
a2 = int(a/10%10)
a3 = int(a%10)
aSum = int(a1+a2+a3)
if (a > 99 and a < 1000):
    print(f"{a1} + {a2} + {a3} = {aSum}")
else:
    print("Введите трехзначное число!")